results/4-loadtest/ibm_results/ibm_python_25.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/python_matrix.json
  2 threads and 25 connections
  Thread calibration: mean lat.: 672.749ms, rate sampling interval: 1761ms
  Thread calibration: mean lat.: 749.691ms, rate sampling interval: 2736ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   562.69ms  135.06ms   1.35s    66.11%
    Req/Sec    12.15      1.22    14.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  517.89ms
 75.000%  649.73ms
 90.000%  763.39ms
 99.000%  890.88ms
 99.900%    1.30s 
 99.990%    1.35s 
 99.999%    1.35s 
100.000%    1.35s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     337.151     0.000000            1         1.00
     408.063     0.100000          125         1.11
     467.199     0.200000          251         1.25
     483.071     0.300000          375         1.43
     499.967     0.400000          500         1.67
     517.887     0.500000          624         2.00
     528.895     0.550000          687         2.22
     549.375     0.600000          750         2.50
     583.167     0.650000          812         2.86
     610.303     0.700000          875         3.33
     649.727     0.750000          936         4.00
     684.543     0.775000          968         4.44
     714.239     0.800000         1002         5.00
     728.063     0.825000         1031         5.71
     739.839     0.850000         1061         6.67
     750.591     0.875000         1092         8.00
     756.223     0.887500         1108         8.89
     764.415     0.900000         1124        10.00
     770.559     0.912500         1139        11.43
     780.287     0.925000         1155        13.33
     791.039     0.937500         1171        16.00
     794.111     0.943750         1179        17.78
     798.207     0.950000         1186        20.00
     810.495     0.956250         1195        22.86
     820.735     0.962500         1202        26.67
     839.679     0.968750         1209        32.00
     847.359     0.971875         1214        35.56
     849.407     0.975000         1218        40.00
     855.551     0.978125         1221        45.71
     865.791     0.981250         1225        53.33
     875.007     0.984375         1229        64.00
     877.055     0.985938         1231        71.11
     881.151     0.987500         1233        80.00
     884.735     0.989062         1235        91.43
     893.439     0.990625         1237       106.67
     898.047     0.992188         1239       128.00
     903.679     0.992969         1240       142.22
     906.239     0.993750         1241       160.00
     916.991     0.994531         1242       182.86
     918.015     0.995313         1243       213.33
     920.575     0.996094         1244       256.00
     920.575     0.996484         1244       284.44
     928.767     0.996875         1245       320.00
     928.767     0.997266         1245       365.71
     933.887     0.997656         1246       426.67
     933.887     0.998047         1246       512.00
     933.887     0.998242         1246       568.89
    1302.527     0.998437         1247       640.00
    1302.527     0.998633         1247       731.43
    1302.527     0.998828         1247       853.33
    1302.527     0.999023         1247      1024.00
    1302.527     0.999121         1247      1137.78
    1348.607     0.999219         1248      1280.00
    1348.607     1.000000         1248          inf
#[Mean    =      562.693, StdDeviation   =      135.058]
#[Max     =     1347.584, Total count    =         1248]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1482 requests in 1.00m, 1.29MB read
Requests/sec:     24.69
Transfer/sec:     21.97KB