results/4-loadtest/ibm_results/ibm_python_50.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/python_matrix.json
  2 threads and 50 connections
  Thread calibration: mean lat.: 667.092ms, rate sampling interval: 2043ms
  Thread calibration: mean lat.: 671.764ms, rate sampling interval: 2092ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   536.02ms  120.34ms   1.40s    73.72%
    Req/Sec    24.34      2.65    33.00     87.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  503.04ms
 75.000%  569.85ms
 90.000%  728.06ms
 99.000%  920.58ms
 99.900%    1.29s 
 99.990%    1.41s 
 99.999%    1.41s 
100.000%    1.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     343.551     0.000000            1         1.00
     418.815     0.100000          250         1.11
     449.279     0.200000          502         1.25
     471.295     0.300000          750         1.43
     486.399     0.400000         1003         1.67
     503.039     0.500000         1255         2.00
     512.511     0.550000         1376         2.22
     522.495     0.600000         1503         2.50
     532.991     0.650000         1626         2.86
     546.815     0.700000         1750         3.33
     569.855     0.750000         1878         4.00
     591.871     0.775000         1938         4.44
     617.983     0.800000         2002         5.00
     644.607     0.825000         2063         5.71
     675.839     0.850000         2125         6.67
     702.975     0.875000         2188         8.00
     715.775     0.887500         2220         8.89
     728.063     0.900000         2251        10.00
     736.767     0.912500         2283        11.43
     746.495     0.925000         2314        13.33
     759.807     0.937500         2344        16.00
     765.951     0.943750         2362        17.78
     768.511     0.950000         2376        20.00
     775.167     0.956250         2391        22.86
     783.871     0.962500         2407        26.67
     797.183     0.968750         2422        32.00
     806.911     0.971875         2430        35.56
     816.639     0.975000         2438        40.00
     829.439     0.978125         2446        45.71
     849.407     0.981250         2455        53.33
     863.743     0.984375         2461        64.00
     873.471     0.985938         2465        71.11
     888.831     0.987500         2469        80.00
     909.311     0.989062         2473        91.43
     927.743     0.990625         2477       106.67
     944.127     0.992188         2481       128.00
     951.807     0.992969         2483       142.22
     952.831     0.993750         2485       160.00
     954.879     0.994531         2488       182.86
     955.391     0.995313         2489       213.33
     964.095     0.996094         2491       256.00
     975.871     0.996484         2492       284.44
     979.455     0.996875         2493       320.00
    1014.783     0.997266         2494       365.71
    1146.879     0.997656         2495       426.67
    1195.007     0.998047         2496       512.00
    1195.007     0.998242         2496       568.89
    1223.679     0.998437         2497       640.00
    1223.679     0.998633         2497       731.43
    1285.119     0.998828         2498       853.33
    1285.119     0.999023         2498      1024.00
    1285.119     0.999121         2498      1137.78
    1296.383     0.999219         2499      1280.00
    1296.383     0.999316         2499      1462.86
    1296.383     0.999414         2499      1706.67
    1296.383     0.999512         2499      2048.00
    1296.383     0.999561         2499      2275.56
    1405.951     0.999609         2500      2560.00
    1405.951     1.000000         2500          inf
#[Mean    =      536.021, StdDeviation   =      120.338]
#[Max     =     1404.928, Total count    =         2500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2950 requests in 1.01m, 2.56MB read
Requests/sec:     48.90
Transfer/sec:     43.51KB