results/4-loadtest/ibm_results/ibm_python_800.txt
Running 1m test @ https://us-east.functions.cloud.ibm.com/api/v1/web/functionOrg_functionSpace/default/python_matrix.json
  2 threads and 800 connections
  Thread calibration: mean lat.: 708.471ms, rate sampling interval: 2568ms
  Thread calibration: mean lat.: 737.724ms, rate sampling interval: 2684ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   592.59ms  184.44ms   2.83s    78.35%
    Req/Sec   401.54     39.11   497.00     74.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  545.28ms
 75.000%  673.28ms
 90.000%  825.85ms
 99.000%    1.33s 
 99.900%    1.67s 
 99.990%    2.25s 
 99.999%    2.83s 
100.000%    2.83s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     321.023     0.000000            1         1.00
     419.839     0.100000         3844         1.11
     454.143     0.200000         7657         1.25
     484.095     0.300000        11482         1.43
     513.535     0.400000        15298         1.67
     545.279     0.500000        19112         2.00
     561.151     0.550000        21004         2.22
     580.607     0.600000        22946         2.50
     603.135     0.650000        24821         2.86
     632.319     0.700000        26745         3.33
     673.279     0.750000        28653         4.00
     696.319     0.775000        29607         4.44
     720.383     0.800000        30561         5.00
     746.495     0.825000        31513         5.71
     768.511     0.850000        32462         6.67
     794.623     0.875000        33412         8.00
     808.959     0.887500        33905         8.89
     825.855     0.900000        34374        10.00
     842.239     0.912500        34858        11.43
     856.575     0.925000        35331        13.33
     870.399     0.937500        35809        16.00
     879.615     0.943750        36040        17.78
     893.951     0.950000        36280        20.00
     914.431     0.956250        36515        22.86
     941.055     0.962500        36756        26.67
     967.167     0.968750        36992        32.00
     983.551     0.971875        37115        35.56
    1018.879     0.975000        37231        40.00
    1071.103     0.978125        37351        45.71
    1118.207     0.981250        37470        53.33
    1187.839     0.984375        37590        64.00
    1242.111     0.985938        37649        71.11
    1278.975     0.987500        37710        80.00
    1304.575     0.989062        37768        91.43
    1339.391     0.990625        37828       106.67
    1372.159     0.992188        37892       128.00
    1395.711     0.992969        37929       142.22
    1401.855     0.993750        37948       160.00
    1473.535     0.994531        37977       182.86
    1542.143     0.995313        38007       213.33
    1576.959     0.996094        38046       256.00
    1577.983     0.996484        38070       284.44
    1577.983     0.996875        38070       320.00
    1579.007     0.997266        38091       365.71
    1580.031     0.997656        38110       426.67
    1581.055     0.998047        38116       512.00
    1582.079     0.998242        38123       568.89
    1583.103     0.998437        38127       640.00
    1601.535     0.998633        38134       731.43
    1607.679     0.998828        38141       853.33
    1686.527     0.999023        38148      1024.00
    1737.727     0.999121        38152      1137.78
    1787.903     0.999219        38156      1280.00
    1812.479     0.999316        38159      1462.86
    1855.487     0.999414        38163      1706.67
    1879.039     0.999512        38167      2048.00
    1924.095     0.999561        38169      2275.56
    1940.479     0.999609        38171      2560.00
    1973.247     0.999658        38172      2925.71
    2052.095     0.999707        38174      3413.33
    2071.551     0.999756        38176      4096.00
    2094.079     0.999780        38177      4551.11
    2095.103     0.999805        38178      5120.00
    2142.207     0.999829        38179      5851.43
    2152.447     0.999854        38180      6826.67
    2246.655     0.999878        38181      8192.00
    2246.655     0.999890        38181      9102.22
    2269.183     0.999902        38182     10240.00
    2269.183     0.999915        38182     11702.86
    2404.351     0.999927        38183     13653.33
    2404.351     0.999939        38183     16384.00
    2404.351     0.999945        38183     18204.44
    2641.919     0.999951        38184     20480.00
    2641.919     0.999957        38184     23405.71
    2641.919     0.999963        38184     27306.67
    2641.919     0.999969        38184     32768.00
    2641.919     0.999973        38184     36408.89
    2828.287     0.999976        38185     40960.00
    2828.287     1.000000        38185          inf
#[Mean    =      592.585, StdDeviation   =      184.441]
#[Max     =     2826.240, Total count    =        38185]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  46847 requests in 1.00m, 40.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:    779.71
Transfer/sec:    693.67KB